# test
import random

deck_of_cards = { 'Двійка чірви':2, 'Трійка чірви':3, 'Четвірка чірви':4, 'Пятірка чірви':5, 'Шестірка чірви':6, 'Сімірка чірви':7, 'Вісьмірка чірви':8
                     , 'Девятка чірви':9, 'Десятка чірви':10, 'Валет чірви':1, 'Дама чірви':2, 'Король чірви':3, 'Туз чірви':11,'Двійка піки':2
                     , 'Трійка піки':3, 'Четвірка піки':4, 'Пятірка піки':5, 'Шестірка піки':6, 'Сімірка піки':7, 'Вісьмірка піки':8, 'Девятка піки':9
                     , 'Десятка піки':10, 'Валет піки':1, 'Дама піки':2, 'Король піки':3, 'Туз піки':11,'Двійка буби':2, 'Трійка буби':3, 'Четвірка буби':4
                     , 'Пятірка буби':5, 'Шестірка буби':6, 'Сімірка буби':7, 'Вісьмірка буби':8, 'Девятка буби':9, 'Десятка буби':10, 'Валет буби':1
                     , 'Дама буби':2, 'Король буби':3, 'Туз буби':11, 'Двійка хрісти':2, 'Трійка хрісти':3, 'Четвірка хрісти':4, 'Пятірка хрісти':5, 'Шестірка хрісти':6
                     , 'Сімірка хрісти':7, 'Вісьмірка хрісти':8, 'Девятка хрісти':9, 'Десятка хрісти':10, 'Валет хрісти':1, 'Дама хрісти':2, 'Король хрісти':3
                     , 'Туз хрісти':11 }
f=False
if not f:print('qwe')

        
             

        