# Конвертор азбуки Морзе

def converter(s):
    morze_value = { ',':'--..--', '.':'.-.-.-', '?':'..--..', '0':'-----', '1':'.----', '2':'..---', '3':'...--', '4':'....-', '5':'.....'
                    ,'6':'-....', '7':'--...', '8':'---..', '9':'----.', 'A':'.-', 'B':'-...', 'C':'-.-.', 'D':'-..', 'E':'.', 'F':'..-.' 
                    , 'G':'--.', 'H':'....', 'I':'..', 'J':'.---', 'K':'-.-', 'L':'.-..', 'M':'--', 'N':'-.', 'O':'---', 'P':'.--.'
                    , 'Q':'--.-', 'R':'.-.', 'S':'...', 'T':'-', 'U':'..-', 'V':'...-', 'W':'.--', 'X':'-..-', 'Y':'-.-', 'Z':'--..' }

    s=s.upper()
    res=''
    for letter in s:
        if letter==' ':
                res+='    '
                continue
        for key in morze_value.keys():
            if letter==key:
                res+=morze_value.get(key)+' '
                
    return res

def main():
    q=0
    while q!=1:
        s=str(input('Введіть що хочете конвертувати в азбуку Морзе: '))
        res=converter(s)
        print(f'Конвертоване повідомлення: {res}')
        q=int(input('Закінчити(1): '))
    
    
if __name__ == "__main__":
    main()
    